dic = {
    "1号线":{
       "东区":{
           "门牌号1":"3号",
           '门牌号2':'02'
       },
       "南区":{
           "门牌号1":"01",
           "门牌号2":"02"
       },
       "西区":{
           "门牌号1":"01",
           "门牌号2":"02",
           "门牌号3":"03"
       },
       "北区":{
           "门牌号1":"01",
           "门牌号2":"02",
           "门牌号3":"03",
           "门牌号4":"04"
       }
   },
    "2号线":{
       "东区":{"门牌号1":"01"},
       "南区":{"门牌号2":"02"},
       "西区":{"门牌号3":"03"},
       "北区":{"门牌号4":"04"}
   },
    "3号线":{
       "东区":{"门牌号1":"01"},
       "南区":{"门牌号2":"02"},
       "西区":{"门牌号3":"03"},
       "北区":{"门牌号4":"04"}
   },
    "4号线":{
       "东区":{"门牌号1":"01"},
       "南区":{"门牌号2":"02"},
       "西区":{"门牌号3":"03"},
       "北区":{"门牌号4":"04"}
   }
}

def a(data):
    for i in data:
        print(i)

while True:
    a(dic)
    num_1 = input('要坐几号线？')
    if num_1 in dic:
        a(dic[num_1])
        num_2 = input('去哪个区？')
        if num_2 in dic[num_1]:
            a(dic[num_1][num_2])
            num_3 = input('门牌号多少啊？')
            if num_3 in dic[num_1][num_2]:
                a(dic[num_1][num_2][num_3])
            else:
                print('没这号！\n')
        else:
            print('没这区！\n')
    else:
        print('没这地铁！\n')
















